[
  {
    "fact": "Bananas are berries, but strawberries are not.",
    "info": "Botanically, bananas meet the criteria for berries, while strawberries do not.",
    "source": "Britannica"
  },
  {
    "fact": "Octopuses have three hearts.",
    "info": "Two pump blood to the gills, one pumps blood to the rest of the body.",
    "source": "Smithsonian Ocean"
  },
  {
    "fact": "Wombat poop is cube-shaped.",
    "info": "This unique shape helps the poop not to roll away, marking territory more effectively.",
    "source": "BBC, National Geographic"
  },
  {
    "fact": "Venus is the only planet in our Solar System that rotates clockwise.",
    "info": "All other planets rotate counterclockwise.",
    "source": "NASA"
  },
  {
    "fact": "The Eiffel Tower can be 15 cm taller during hot days.",
    "info": "Metal expands with heat, so the iron structure gets taller in summer.",
    "source": "Eiffel Tower Official Site"
  },
  {
    "fact": "Sharks existed before trees.",
    "info": "Sharks date back over 400 million years, while the first trees appeared around 350 million years ago.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "A group of flamingos is called a 'flamboyance.'",
    "info": "Collective nouns for animals can be quite colorful!",
    "source": "Oxford Dictionaries"
  },
  {
    "fact": "The longest English word without a true vowel is 'rhythms.'",
    "info": "It only uses the letter 'y' as a vowel sound.",
    "source": "Oxford English Dictionary"
  },
  {
    "fact": "Some turtles can breathe through their butts.",
    "info": "Certain species, like the Australian Fitzroy River turtle, can absorb oxygen through their cloaca.",
    "source": "Australian Museum"
  },

  {
    "fact": "Sloths can hold their breath longer than dolphins.",
    "info": "Sloths can slow their heart rate and hold their breath for up to 40 minutes, while dolphins typically hold their breath for around 10 minutes.",
    "source": "Smithsonian's National Zoo"
  },

  {
    "fact": "The fingerprints of a koala are nearly identical to humans.",
    "info": "Koala fingerprints are so similar to human ones that they can confuse crime scene investigators.",
    "source": "Australian Koala Foundation"
  },
  {
    "fact": "Water can boil and freeze at the same time.",
    "info": "This phenomenon is called the 'triple point' and occurs when temperature and pressure are just right for the three states of a substance (solid, liquid, and gas) to coexist in equilibrium.",
    "source": "NASA"
  },

  {
    "fact": "Butterflies can taste with their feet.",
    "info": "Taste sensors on a butterfly’s feet allow it to identify whether a plant is suitable for laying eggs.",
    "source": "Smithsonian National Museum of Natural History"
  },
  {
    "fact": "The fastest tennis serve ever recorded was 163.7 mph.",
    "info": "Australian tennis player Sam Groth achieved this record-breaking serve in 2012 at the Busan Open Challenger.",
    "source": "Guinness World Records"
  },
  {
    "fact": "The Great Wall of China is not visible from space with the naked eye.",
    "info": "Despite the popular myth, the wall is too narrow and blends with its surroundings, making it nearly impossible to see from space.",
    "source": "NASA"
  },
  {
    "fact": "Jellyfish existed before dinosaurs.",
    "info": "Jellyfish have been around for over 500 million years, predating dinosaurs by hundreds of millions of years.",
    "source": "Smithsonian Ocean"
  },
  {
    "fact": "The Olympic Games have been held in space.",
    "info": "In 2021, astronauts on the International Space Station held a 'Space Olympics,' competing in zero-gravity sports like synchronized floating.",
    "source": "NASA"
  },
  {
    "fact": "There’s a basketball court inside the U.S. Supreme Court building.",
    "info": "Located on the top floor, it’s nicknamed 'the highest court in the land.'",
    "source": "Supreme Court Historical Society"
  },
  {
    "fact": "Venus is the hottest planet in the solar system.",
    "info": "Despite being the second planet from the Sun, Venus has a thick atmosphere of carbon dioxide that traps heat, making its surface temperature reach 900°F (475°C).",
    "source": "NASA"
  },
  {
    "fact": "Sharks do not have bones.",
    "info": "Their skeletons are made of cartilage, the same flexible material found in human noses and ears.",
    "source": "NOAA"
  },
  {
    "fact": "Soccer is the most popular sport in the world.",
    "info": "An estimated 4 billion people globally watch or play soccer, making it the most-followed sport.",
    "source": "FIFA"
  },
  {
    "fact": "Saturn’s moon, Titan, has rivers of liquid methane.",
    "info": "Titan is the only place in the solar system other than Earth known to have liquid rivers, lakes, and seas on its surface.",
    "source": "NASA"
  },
  {
    "fact": "The speed of a sneeze can reach up to 100 mph.",
    "info": "A sneeze can release thousands of tiny droplets traveling at high speeds, which is why covering your mouth is important.",
    "source": "Harvard Medical School"
  },
  {
    "fact": "The longest recorded chess game lasted 20 hours and 15 minutes.",
    "info": "This game was played in 1989 between Ivan Nikolić and Goran Arsović and lasted 269 moves.",
    "source": "World Chess Federation (FIDE)"
  },
  {
    "fact": "The Moon is moving away from Earth.",
    "info": "The Moon drifts about 1.5 inches farther from Earth each year due to tidal interactions.",
    "source": "NASA"
  },
  {
    "fact": "The Eiffel Tower can shrink in winter.",
    "info": "In cold temperatures, the metal contracts, making the tower shrink by about 6 inches.",
    "source": "Eiffel Tower Official Website"
  },
  {
    "fact": "The human brain generates enough electricity to power a small light bulb.",
    "info": "With around 86 billion neurons firing signals, the brain can produce about 20 watts of electrical power.",
    "source": "Scientific American"
  },
  {
    "fact": "Antarctica is the driest place on Earth.",
    "info": "Despite being covered in ice, some parts of Antarctica haven’t seen rain in nearly 2 million years.",
    "source": "National Science Foundation"
  },
  {
    "fact": "The world’s smallest reptile was discovered in 2021.",
    "info": "The Brookesia nana, a tiny chameleon species found in Madagascar, measures just 0.53 inches in length.",
    "source": "Nature"
  },
  {
    "fact": "The first Super Bowl was played in 1967.",
    "info": "This iconic American football game was held between the Green Bay Packers and the Kansas City Chiefs, with the Packers winning 35-10.",
    "source": "NFL"
  },
  {
    "fact": "A day on Venus is longer than a year on Venus.",
    "info": "Venus takes 243 Earth days to complete one rotation on its axis, but only 225 Earth days to orbit the Sun.",
    "source": "NASA"
  },
  {
    "fact": "Lightning strikes about 8 million times a day worldwide.",
    "info": "This equates to about 100 lightning strikes per second across the globe.",
    "source": "National Weather Service"
  },
  {
    "fact": "The human nose can detect over 1 trillion scents.",
    "info": "Research has shown that our sense of smell is far more sensitive than previously thought.",
    "source": "Science Magazine"
  },
  {
    "fact": "Mount Everest grows about 4 millimeters every year.",
    "info": "This is due to the tectonic collision between the Indian and Eurasian plates.",
    "source": "National Geographic"
  },
  {
    "fact": "Canada has the most lakes of any country in the world.",
    "info": "Canada is home to over 2 million lakes, which contain 20% of the world’s freshwater.",
    "source": "World Atlas"
  },
  {
    "fact": "Iceland is the only country without mosquitoes.",
    "info": "Iceland's low temperatures and lack of suitable breeding grounds prevent mosquitoes from thriving.",
    "source": "Icelandic Institute of Natural History"
  },
  {
    "fact": "Africa is the only continent that is in all four hemispheres.",
    "info": "It is situated in the Northern, Southern, Eastern, and Western Hemispheres.",
    "source": "National Geographic"
  },
  {
    "fact": "Russia spans 11 time zones.",
    "info": "It is the largest country in the world by area, covering a vast range of time zones.",
    "source": "World Atlas"
  },
  {
    "fact": "The Sahara Desert was once a lush, green landscape.",
    "info": "About 6,000–7,000 years ago, it had lakes, rivers, and vegetation due to a wetter climate.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "Lake Baikal in Russia is the deepest lake in the world.",
    "info": "It reaches a depth of 5,387 feet (1,642 meters) and holds about 20% of the world's unfrozen freshwater.",
    "source": "UNESCO"
  },
  {
    "fact": "The Amazon Rainforest produces 20% of the world's oxygen.",
    "info": "Known as the 'lungs of the Earth,' the Amazon plays a vital role in regulating the planet’s climate.",
    "source": "World Wildlife Fund"
  },
  {
    "fact": "Antarctica is the coldest, driest, and windiest continent.",
    "info": "It holds the record for the lowest temperature ever recorded, at −128.6°F (−89.2°C).",
    "source": "National Science Foundation"
  },
  {
    "fact": "Australia is wider than the Moon.",
    "info": "Australia measures about 4,000 km (2,485 miles) across, while the Moon’s diameter is about 3,474 km (2,159 miles).",
    "source": "NASA"
  },
  {
    "fact": "Asia is home to the top 10 tallest mountains in the world.",
    "info": "All of these peaks, including Mount Everest, are part of the Himalayan mountain range.",
    "source": "National Geographic"
  },
  {
    "fact": "The Dead Sea is the lowest point on Earth’s surface.",
    "info": "It sits at about 430 meters (1,410 feet) below sea level.",
    "source": "National Geographic"
  },
  {
    "fact": "Greenland is the largest island in the world.",
    "info": "It covers an area of about 2.16 million square kilometers (836,000 square miles).",
    "source": "World Atlas"
  },
  {
    "fact": "The Pacific Ocean is larger than all of the Earth’s landmasses combined.",
    "info": "It spans about 63 million square miles, making it the largest ocean on Earth.",
    "source": "NOAA"
  },
  {
    "fact": "The Nile River is the longest river in the world.",
    "info": "It stretches about 6,650 km (4,130 miles) and flows through 11 countries in Africa.",
    "source": "National Geographic"
  },
  {
    "fact": "Tokyo is the most populous city in the world.",
    "info": "The Tokyo metropolitan area is home to over 37 million people.",
    "source": "United Nations"
  },
  {
    "fact": "The Great Barrier Reef is the largest living structure on Earth.",
    "info": "It stretches over 2,300 kilometers (1,430 miles) off the coast of Australia and can be seen from space.",
    "source": "UNESCO"
  },
  {
    "fact": "There are 195 countries in the world.",
    "info": "This includes 193 UN member states and 2 observer states, the Holy See and Palestine.",
    "source": "United Nations"
  },
  {
    "fact": "The city of Istanbul spans two continents.",
    "info": "It is located on both the European and Asian sides of the Bosporus Strait, making it a transcontinental city.",
    "source": "World Atlas"
  },
  {
    "fact": "Africa is the only continent with land in all four cardinal hemispheres.",
    "info": "It stretches from the northern to the southern hemisphere and from the eastern to the western hemisphere.",
    "source": "National Geographic"
  },
  {
    "fact": "Cleopatra lived closer in time to the moon landing than to the construction of the Great Pyramid of Giza.",
    "info": "The Great Pyramid was built around 2560 BCE, while Cleopatra lived between 69–30 BCE. The moon landing happened in 1969 CE.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "Oxford University is older than the Aztec Empire.",
    "info": "Teaching at Oxford began in 1096, while the Aztec Empire was founded in 1428.",
    "source": "Oxford University Archives"
  },
  {
    "fact": "The shortest war in history lasted 38–45 minutes.",
    "info": "The Anglo-Zanzibar War was fought on August 27, 1896, between the United Kingdom and Zanzibar.",
    "source": "Guinness World Records"
  },
  {
    "fact": "Napoleon Bonaparte was once attacked by a horde of rabbits.",
    "info": "During a rabbit hunt arranged by his staff, the rabbits swarmed Napoleon instead of running away.",
    "source": "History.com"
  },
  {
    "fact": "The Eiffel Tower was originally intended to be dismantled after 20 years.",
    "info": "It was saved because it proved useful as a radio transmission tower.",
    "source": "Eiffel Tower Official Website"
  },
  {
    "fact": "Julius Caesar was once kidnapped by pirates.",
    "info": "While held for ransom, Caesar reportedly demanded the pirates increase the ransom because he claimed he was worth more.",
    "source": "Plutarch's 'Lives'"
  },
  {
    "fact": "Albert Einstein was offered the presidency of Israel in 1952.",
    "info": "Einstein declined, stating he lacked the experience for the position.",
    "source": "Israel Ministry of Foreign Affairs"
  },
  {
    "fact": "The Great Fire of London in 1666 destroyed 80% of the city but only six people were recorded as dying.",
    "info": "The low death toll is attributed to the fire spreading slowly enough for most residents to escape.",
    "source": "Museum of London"
  },
  {
    "fact": "The first known use of paper money was in China.",
    "info": "It was introduced during the Tang Dynasty around the 7th century.",
    "source": "British Museum"
  },
  {
    "fact": "The guillotine was used in France until 1977.",
    "info": "The last execution by guillotine occurred just months before France abolished the death penalty.",
    "source": "BBC"
  },
  {
    "fact": "The longest-reigning monarch in history was Louis XIV of France.",
    "info": "He reigned for 72 years and 110 days, from 1643 to 1715.",
    "source": "History.com"
  },
  {
    "fact": "George Washington grew hemp on his farm.",
    "info": "Hemp was commonly grown in colonial America for rope, fabric, and other materials.",
    "source": "Mount Vernon"
  },
  {
    "fact": "The Colosseum in Rome had a retractable roof.",
    "info": "The velarium, a massive canvas awning, was used to shade spectators from the sun.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The Great Wall of China is not a single wall.",
    "info": "It is a series of walls built by different dynasties over several centuries.",
    "source": "National Geographic"
  },
  {
    "fact": "The first known written recipe was for beer.",
    "info": "It was created by the Sumerians over 5,000 years ago.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The Statue of Liberty was originally intended for Egypt.",
    "info": "It was designed as a lighthouse for the Suez Canal but was rejected by Egypt due to cost.",
    "source": "National Park Service"
  },
  {
    "fact": "Genghis Khan’s empire was the largest contiguous empire in history.",
    "info": "At its peak, it covered approximately 9.27 million square miles.",
    "source": "History.com"
  },
  {
    "fact": "Leonardo da Vinci could write with one hand while drawing with the other.",
    "info": "This ambidextrous skill was part of his extraordinary talents.",
    "source": "The Leonardo Museum"
  },
  {
    "fact": "The first Olympic Games were held in 776 BCE in Olympia, Greece.",
    "info": "The games originally featured only one event: a short footrace called the 'stade.'",
    "source": "International Olympic Committee"
  },
  {
    "fact": "The Titanic had a near-identical sister ship called the Olympic.",
    "info": "The RMS Olympic served for 24 years and was retired in 1935.",
    "source": "Titanic Historical Society"
  },
  {
    "fact": "The Berlin Wall fell in 1989, but its official demolition began in 1990.",
    "info": "The fall symbolized the end of the Cold War.",
    "source": "BBC"
  },
  {
    "fact": "The Hundred Years' War lasted 116 years.",
    "info": "It was fought between England and France from 1337 to 1453.",
    "source": "History.com"
  },
  {
    "fact": "The Mona Lisa has no visible eyebrows.",
    "info": "Experts believe this was either intentional or the result of over-cleaning.",
    "source": "Louvre Museum"
  },
  {
    "fact": "The first email was sent in 1971.",
    "info": "Ray Tomlinson, a computer engineer, sent the first email to himself.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The Great Depression led to Monopoly becoming popular.",
    "info": "The game provided people with a sense of financial control during tough times.",
    "source": "History.com"
  },
  {
    "fact": "The Library of Alexandria was one of the largest libraries in the ancient world.",
    "info": "It housed an estimated 400,000 to 700,000 scrolls.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "Stonehenge was built over 5,000 years ago.",
    "info": "It was constructed in phases over several centuries starting around 3000 BCE.",
    "source": "English Heritage"
  },
  {
    "fact": "The U.S. purchased Alaska from Russia for $7.2 million.",
    "info": "The purchase, in 1867, was known as 'Seward’s Folly' until gold was discovered there.",
    "source": "Library of Congress"
  },
  {
    "fact": "Ancient Romans used urine to whiten their teeth.",
    "info": "The ammonia in urine was a natural cleaning agent.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The Wright brothers’ first flight lasted 12 seconds.",
    "info": "It covered a distance of 120 feet in Kitty Hawk, North Carolina, in 1903.",
    "source": "Wright Brothers National Memorial"
  },
  {
    "fact": "The Black Death killed an estimated 25 million people in Europe.",
    "info": "This was about one-third of Europe’s population during the 14th century.",
    "source": "History.com"
  },
  {
    "fact": "The Eiffel Tower was the tallest man-made structure until 1930.",
    "info": "It was surpassed by the Chrysler Building in New York City.",
    "source": "Eiffel Tower Official Website"
  },
  {
    "fact": "The first vaccine was developed in 1796 for smallpox.",
    "info": "Edward Jenner used material from cowpox sores to create immunity.",
    "source": "World Health Organization"
  },
  {
    "fact": "The Leaning Tower of Pisa took 199 years to build.",
    "info": "Construction began in 1173 and was completed in 1372.",
    "source": "UNESCO"
  },
  {
    "fact": "The Roman Colosseum could hold up to 80,000 spectators.",
    "info": "It was used for gladiatorial contests, mock sea battles, and animal hunts.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The Mayans used chocolate as currency.",
    "info": "Cacao beans were highly valued and traded as money in Mesoamerican cultures.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The first known use of fireworks was in China.",
    "info": "They were invented during the Tang Dynasty in the 9th century.",
    "source": "History.com"
  },
  {
    "fact": "The Great Wall of China is over 13,000 miles long.",
    "info": "It was built to protect against invasions and raids.",
    "source": "National Geographic"
  },
  {
    "fact": "The first moon landing was in 1969.",
    "info": "Neil Armstrong and Buzz Aldrin became the first humans to walk on the Moon during Apollo 11.",
    "source": "NASA"
  },
  {
    "fact": "The Taj Mahal was built as a mausoleum.",
    "info": "Emperor Shah Jahan built it in memory of his wife Mumtaz Mahal.",
    "source": "UNESCO"
  },
  {
    "fact": "The Cold War never resulted in direct combat between the U.S. and the Soviet Union.",
    "info": "It was characterized by political tension, nuclear threats, and proxy wars.",
    "source": "History.com"
  },
  {
    "fact": "The first printing press was invented by Johannes Gutenberg.",
    "info": "The Gutenberg press revolutionized the spread of information in the 15th century.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The first modern Olympics were held in Athens in 1896.",
    "info": "There were 241 athletes from 14 nations competing in 43 events.",
    "source": "International Olympic Committee"
  },
  {
    "fact": "The Berlin Wall stood for 28 years.",
    "info": "It divided East and West Berlin from 1961 to 1989.",
    "source": "BBC"
  },
  {
    "fact": "The Magna Carta was signed in 1215.",
    "info": "It limited the power of the monarchy and laid the foundation for modern democracy.",
    "source": "British Library"
  },
  {
    "fact": "The human body contains enough carbon to fill 9,000 pencils.",
    "info": "Carbon is one of the key elements in the human body, making up about 18% of body mass.",
    "source": "Royal Society of Chemistry"
  },
  {
    "fact": "Your stomach gets a new lining every 3–4 days.",
    "info": "This prevents the stomach from digesting itself due to the strong acidic environment.",
    "source": "Johns Hopkins Medicine"
  },
  {
    "fact": "The brain generates about 20 watts of electricity.",
    "info": "This is enough to power a small light bulb.",
    "source": "Scientific American"
  },
  {
    "fact": "The average human blinks around 15–20 times per minute.",
    "info": "That adds up to about 28,800 blinks per day.",
    "source": "American Academy of Ophthalmology"
  },
  {
    "fact": "Water makes up about 60% of an adult human body.",
    "info": "This percentage varies based on age, gender, and hydration levels.",
    "source": "USGS"
  },
  {
    "fact": "The human nose can detect over 1 trillion different scents.",
    "info": "This is far more than the previously estimated 10,000 scents.",
    "source": "Science Magazine"
  },
  {
    "fact": "Yawning cools down your brain.",
    "info": "It helps regulate brain temperature and maintain alertness.",
    "source": "Frontiers in Neuroscience"
  },
  {
    "fact": "Your bones are about five times stronger than steel of the same density.",
    "info": "They are strong and lightweight, making them ideal for supporting the body.",
    "source": "Scientific American"
  },
  {
    "fact": "The speed of a sneeze can reach up to 100 mph.",
    "info": "Sneezes can expel thousands of droplets at high velocity.",
    "source": "Harvard Medical School"
  },
  {
    "fact": "The human heart beats over 3 billion times in an average lifetime.",
    "info": "This is based on an average heart rate of 80 beats per minute.",
    "source": "American Heart Association"
  },
  {
    "fact": "The average human body has about 37.2 trillion cells.",
    "info": "Each cell performs specialized functions to sustain life.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "DNA in your cells would stretch to Pluto and back—17 times.",
    "info": "If uncoiled, the DNA in a single cell would be about 2 meters long.",
    "source": "National Human Genome Research Institute"
  },
  {
    "fact": "The liver is the only organ that can regenerate itself.",
    "info": "Even if up to 75% of the liver is removed, it can grow back to its original size.",
    "source": "Johns Hopkins Medicine"
  },
  {
    "fact": "Your brain uses about 20% of your body's oxygen and calories.",
    "info": "Despite its small size, the brain is a highly energy-demanding organ.",
    "source": "National Institute of Neurological Disorders and Stroke"
  },
  {
    "fact": "A single human hair can support the weight of 100 grams.",
    "info": "Keratin, the protein in hair, provides its remarkable strength.",
    "source": "Scientific American"
  },
  {
    "fact": "The small intestine is about 22 feet long.",
    "info": "It is responsible for most of the absorption of nutrients during digestion.",
    "source": "Cleveland Clinic"
  },
  {
    "fact": "Your blood travels about 12,000 miles every day.",
    "info": "This is equivalent to half the circumference of the Earth.",
    "source": "American Heart Association"
  },
  {
    "fact": "The average person produces enough saliva in a lifetime to fill two swimming pools.",
    "info": "Saliva plays a key role in digestion and oral health.",
    "source": "National Institutes of Health"
  },
  {
    "fact": "The human eye can distinguish about 10 million different colors.",
    "info": "This ability varies slightly from person to person.",
    "source": "American Academy of Ophthalmology"
  },
  {
    "fact": "Your skin sheds about 1.5 pounds of dead cells each year.",
    "info": "The skin is constantly renewing itself, making it the largest organ of the body.",
    "source": "American Academy of Dermatology"
  },
  {
    "fact": "The human body has about 100,000 miles of blood vessels.",
    "info": "If lined up end to end, they could circle the Earth four times.",
    "source": "National Geographic"
  },
  {
    "fact": "Babies have about 300 bones at birth, but adults have only 206.",
    "info": "Some bones fuse together as the body grows.",
    "source": "Cleveland Clinic"
  },
  {
    "fact": "The human brain contains about 86 billion neurons.",
    "info": "These neurons communicate through trillions of connections called synapses.",
    "source": "National Institute of Neurological Disorders and Stroke"
  },
  {
    "fact": "Your body has more bacterial cells than human cells.",
    "info": "The human microbiome contains trillions of bacteria, which are vital for health.",
    "source": "National Institutes of Health"
  },
  {
    "fact": "The tongue is the strongest muscle in the human body relative to its size.",
    "info": "It is also the only muscle attached at one end.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "You can’t tickle yourself because your brain predicts the sensation.",
    "info": "The cerebellum cancels out the sensation caused by your own movements.",
    "source": "Nature Neuroscience"
  },
  {
    "fact": "The left lung is smaller than the right lung.",
    "info": "This is to make space for the heart.",
    "source": "American Lung Association"
  },
  {
    "fact": "The average human brain weighs about 3 pounds.",
    "info": "It is made up of about 75% water.",
    "source": "Cleveland Clinic"
  },
  {
    "fact": "Your body contains about 0.2 milligrams of gold.",
    "info": "Most of this gold is found in your blood.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "The hardest substance in the human body is tooth enamel.",
    "info": "It is even stronger than bone.",
    "source": "American Dental Association"
  },
  {
    "fact": "Humans share about 60% of their DNA with bananas.",
    "info": "This highlights common ancestry with all living organisms.",
    "source": "National Human Genome Research Institute"
  },
  {
    "fact": "Your ears and nose never stop growing.",
    "info": "This is due to cartilage continuing to grow and gravity causing them to sag.",
    "source": "BBC Science Focus"
  },
  {
    "fact": "The average person walks the equivalent of five times around the Earth in their lifetime.",
    "info": "This is based on an average of 7,500 steps per day over 80 years.",
    "source": "American Podiatric Medical Association"
  },
  {
    "fact": "Human teeth are as strong as shark teeth.",
    "info": "They are made of similar materials and have a comparable hardness.",
    "source": "National Geographic"
  },
  {
    "fact": "The appendix might not be useless after all.",
    "info": "It plays a role in gut immunity and maintaining healthy gut bacteria.",
    "source": "Duke University Medical Center"
  },
  {
    "fact": "The human stomach can stretch to hold about 1 liter of food.",
    "info": "That’s roughly the size of a football.",
    "source": "Cleveland Clinic"
  },
  {
    "fact": "Humans glow in the dark, but it's invisible to the naked eye.",
    "info": "This is due to the natural emission of bioluminescent light from metabolic reactions.",
    "source": "PLOS One Journal"
  },
  {
    "fact": "Your nails grow faster on your dominant hand.",
    "info": "This is likely due to increased blood flow from frequent use.",
    "source": "American Academy of Dermatology"
  },
  {
    "fact": "The average adult has about 5 liters of blood.",
    "info": "Blood makes up about 7–8% of body weight.",
    "source": "American Red Cross"
  },
  {
    "fact": "The human body produces about 25 million new cells every second.",
    "info": "This process is essential for growth, repair, and survival.",
    "source": "National Institutes of Health"
  },
  {
    "fact": "The human brain can process images in as little as 13 milliseconds.",
    "info": "This makes vision one of the fastest senses.",
    "source": "Massachusetts Institute of Technology"
  },
  {
    "fact": "Your sense of taste is 80% dependent on your sense of smell.",
    "info": "This is why food tastes bland when you have a cold.",
    "source": "American Academy of Otolaryngology"
  },
  {
    "fact": "Goosebumps are a leftover evolutionary response.",
    "info": "They helped our ancestors appear larger when threatened.",
    "source": "Harvard University"
  },
  {
    "fact": "The cornea is the only part of the body without a blood supply.",
    "info": "It gets oxygen directly from the air.",
    "source": "American Academy of Ophthalmology"
  },
  {
    "fact": "Human bones are constantly being broken down and rebuilt.",
    "info": "The entire skeleton is replaced roughly every 10 years.",
    "source": "National Institutes of Health"
  },
  {
    "fact": "Honey properly sealed can last for thousands of years.",
    "info": "Low water activity and acidity inhibit spoilage; edible honey found in tombs.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "Sea otters often hold paws while resting.",
    "info": "Rafting behavior helps prevent individuals from drifting apart.",
    "source": "Monterey Bay Aquarium"
  },
  {
    "fact": "Koala fingerprints closely resemble human fingerprints.",
    "info": "Under microscopy they can be hard to distinguish from human prints.",
    "source": "Australian Federal Police"
  },
  {
    "fact": "Lightning is hotter than the surface of the Sun.",
    "info": "Lightning can reach ~30,000 K; the Sun’s photosphere is ~5,800 K.",
    "source": "U.S. National Weather Service"
  },
  {
    "fact": "Saturn would float in a sufficiently large ocean.",
    "info": "Its average density is less than water.",
    "source": "NASA"
  },
  {
    "fact": "Turritopsis dohrnii is nicknamed the 'immortal jellyfish.'",
    "info": "It can revert its adult cells to a juvenile state after stress.",
    "source": "Proceedings of the National Academy of Sciences"
  },
  {
    "fact": "Peregrine falcons are the fastest animals on Earth.",
    "info": "Stooping dives can exceed 320 km/h (200 mph).",
    "source": "Cornell Lab of Ornithology"
  },
  {
    "fact": "Peanuts are legumes, not true nuts.",
    "info": "They develop in pods underground like peas and beans.",
    "source": "U.S. Department of Agriculture"
  },
  {
    "fact": "Tomatoes are fruits botanically and vegetables legally (in the U.S.).",
    "info": "Nix v. Hedden (1893) classified them as vegetables for tariffs.",
    "source": "U.S. Supreme Court"
  },
  {
    "fact": "A day on Venus is longer than a year on Venus.",
    "info": "Venus rotates once every ~243 Earth days and orbits the Sun in ~225.",
    "source": "NASA"
  },
  {
    "fact": "Mantis shrimp can detect polarized light and many color channels.",
    "info": "Some species have about a dozen photoreceptor types.",
    "source": "University of Bristol"
  },
  {
    "fact": "Platypuses are venomous.",
    "info": "Males have spurs that deliver venom during breeding season.",
    "source": "Australian Museum"
  },
  {
    "fact": "Some turtles can absorb oxygen through their cloaca.",
    "info": "Cloacal respiration aids overwintering in low-oxygen water.",
    "source": "University of Guelph"
  },
  {
    "fact": "Jupiter’s Great Red Spot is a centuries-old storm.",
    "info": "It has been continuously observed since at least the 1800s and likely longer.",
    "source": "NASA Jet Propulsion Laboratory"
  },
  {
    "fact": "The 'first computer bug' was an actual moth.",
    "info": "Engineers documented a moth in the Harvard Mark II in 1947.",
    "source": "Smithsonian National Museum of American History"
  },
  {
    "fact": "Cleopatra lived closer to the Moon landing than to the building of the Great Pyramid.",
    "info": "Cleopatra died in 30 BCE; the Great Pyramid dates to ~2560 BCE; Moon landing was 1969 CE.",
    "source": "Encyclopaedia Britannica"
  },
  {
    "fact": "Elephants are the only mammals that can’t jump.",
    "info": "Their limb structure and mass preclude all four feet leaving the ground simultaneously.",
    "source": "Smithsonian’s National Zoo"
  },
  {
    "fact": "Crows can recognize human faces and remember them.",
    "info": "Experiments show long-term memory of threatening individuals.",
    "source": "University of Washington"
  },
  {
    "fact": "Ravens can plan for future tool use.",
    "info": "Studies show they barter and save tools for later tasks.",
    "source": "Science (AAAS)"
  },
  {
    "fact": "Bats are the only mammals capable of sustained flight.",
    "info": "Flying squirrels glide; bats truly fly with powered wingbeats.",
    "source": "Bat Conservation International"
  },
  {
    "fact": "Mosquitoes are the deadliest animals to humans.",
    "info": "They transmit diseases including malaria, dengue, and Zika.",
    "source": "World Health Organization"
  },
  {
    "fact": "Antarctica is the world’s largest desert.",
    "info": "Defined by precipitation, not sand; it is extremely dry and cold.",
    "source": "U.S. Geological Survey"
  },
  {
    "fact": "Russia spans 11 time zones.",
    "info": "It is the country with the most time zones by count.",
    "source": "Timeanddate.com"
  },
  {
    "fact": "Carrots were originally purple and yellow before orange became common.",
    "info": "Orange cultivars popularized in the Netherlands in the 16th–17th centuries.",
    "source": "Royal Horticultural Society"
  },
  {
    "fact": "Water expands when it freezes.",
    "info": "Ice is about 9% less dense than liquid water, causing expansion.",
    "source": "NOAA"
  },
  {
    "fact": "A circle encloses the largest area for a given perimeter.",
    "info": "This is the isoperimetric inequality in geometry.",
    "source": "Encyclopaedia Britannica"
  },
  {
    "fact": "The observable universe contains roughly 10^80 atoms.",
    "info": "Order-of-magnitude estimate used in cosmology (Eddington number scale).",
    "source": "NASA"
  },
  {
    "fact": "The number of possible chess games is astronomically large.",
    "info": "Claude Shannon estimated a lower bound around 10^120 possible games.",
    "source": "Bell Labs (Claude Shannon, 1950)"
  },
  {
    "fact": "Neutron star matter is extraordinarily dense.",
    "info": "A teaspoon would weigh billions of tons on Earth.",
    "source": "NASA Goddard Space Flight Center"
  },
  {
    "fact": "GPS works because of Einstein’s relativity.",
    "info": "Satellites adjust for time dilation from speed and weaker gravity.",
    "source": "U.S. National Institute of Standards and Technology"
  },
  {
    "fact": "Pringles’ inventor had part of his ashes buried in a Pringles can.",
    "info": "Frederic Baur’s family honored his request in 2008.",
    "source": "Time Magazine"
  },
  {
    "fact": "The blue whale is the largest animal ever known.",
    "info": "Adults can exceed 25 meters and 150 metric tons.",
    "source": "NOAA Fisheries"
  },
  {
    "fact": "Owls can rotate their heads up to 270 degrees.",
    "info": "Specialized vertebrae and blood vessel adaptations enable this range.",
    "source": "Johns Hopkins Medicine"
  },
  {
    "fact": "A group of flamingos is called a 'flamboyance.'",
    "info": "Collective noun used in ornithology and popular references.",
    "source": "Merriam-Webster"
  },
  {
    "fact": "Dolphins call each other by 'names.'",
    "info": "They use unique signature whistles to identify individuals.",
    "source": "Proceedings of the National Academy of Sciences"
  },
  {
    "fact": "Butterflies taste with their feet.",
    "info": "Chemoreceptors on tarsi help locate host plants.",
    "source": "Smithsonian Institution"
  },
  {
    "fact": "Hedgehogs are immune to many snake venoms.",
    "info": "Serum factors confer partial resistance to certain venoms.",
    "source": "University of Oxford"
  },
  {
    "fact": "Caterpillars partially digest into a 'soup' during metamorphosis.",
    "info": "Larval tissues break down; imaginal discs build adult structures.",
    "source": "Scientific American"
  },
  {
    "fact": "Domestic cats can’t taste sweetness.",
    "info": "They lack functional sweet taste receptor genes (Tas1r2).",
    "source": "Monell Chemical Senses Center"
  },
  {
    "fact": "A day on Mars is only about 40 minutes longer than on Earth.",
    "info": "A Martian sol is ~24 hours 39 minutes.",
    "source": "NASA"
  },
  {
    "fact": "The Moon is slowly drifting away from Earth.",
    "info": "It recedes by about 3.8 cm per year.",
    "source": "Lunar Laser Ranging Experiment (NASA)"
  },
  {
    "fact": "The 'Wow!' signal remains an unsolved SETI mystery.",
    "info": "A strong narrowband radio signal detected in 1977 has not repeated.",
    "source": "Ohio State University / SETI Institute"
  },
  {
    "fact": "There are more trees on Earth than stars in the Milky Way.",
    "info": "~3 trillion trees vs. ~100–400 billion Milky Way stars (estimates).",
    "source": "Nature (2015)"
  },
  {
    "fact": "Venus spins in the opposite direction to most planets.",
    "info": "It has a retrograde rotation; the Sun appears to rise in the west there.",
    "source": "ESA"
  },
  {
    "fact": "The highest waterfall fully within the ocean is beneath the Denmark Strait.",
    "info": "Cold dense water cascades ~3.5 km downward along the seafloor.",
    "source": "National Ocean Service (NOAA)"
  },
  {
    "fact": "Ants don’t have lungs.",
    "info": "They exchange gases through spiracles and tracheal tubes.",
    "source": "University of California Agriculture and Natural Resources"
  },
  {
    "fact": "Giraffes have the same number of neck vertebrae as humans.",
    "info": "Both typically have seven cervical vertebrae, though giraffe ones are much longer.",
    "source": "Smithsonian Institution"
  },
  {
    "fact": "A group of crows is called a 'murder.'",
    "info": "Traditional English collective noun recorded in literature.",
    "source": "Oxford English Dictionary"
  },
  {
    "fact": "Koalas are not bears; they are marsupials.",
    "info": "They carry young in a pouch like kangaroos.",
    "source": "Australian Museum"
  },
  {
    "fact": "Hummingbirds can hover and even fly backward.",
    "info": "Their wing motion and high metabolism enable unique flight.",
    "source": "Cornell Lab of Ornithology"
  },
  {
    "fact": "The longest English word in many dictionaries is 'pneumonoultramicroscopicsilicovolcanoconiosis.'",
    "info": "A coined term for a type of lung disease from fine silica dust.",
    "source": "Oxford Languages"
  },
  {
    "fact": "The word 'alphabet' comes from the first two Greek letters, alpha and beta.",
    "info": "Many languages adopted the term via Latin.",
    "source": "Encyclopaedia Britannica"
  },
  {
    "fact": "The first programmable mechanical computer was conceived by Charles Babbage.",
    "info": "The Analytical Engine design included a control unit and memory.",
    "source": "Science Museum, London"
  },
  {
    "fact": "Ada Lovelace is often called the first computer programmer.",
    "info": "Her notes on Babbage’s engine included an algorithm for Bernoulli numbers.",
    "source": "IEEE"
  },
  {
    "fact": "The University of Bologna (founded 1088) is widely regarded as the oldest university.",
    "info": "It has operated continuously since the 11th century.",
    "source": "University of Bologna"
  },
  {
    "fact": "Vatican City is the smallest sovereign country.",
    "info": "It covers about 44 hectares (110 acres).",
    "source": "CIA World Factbook"
  },
  {
    "fact": "Canada has the world’s longest coastline.",
    "info": "Measured at over 200,000 km.",
    "source": "Government of Canada"
  },
  {
    "fact": "The Amazon River carries more water than any other river.",
    "info": "It has the highest average discharge in the world.",
    "source": "U.S. Geological Survey"
  },
  {
    "fact": "Greenland is the world’s largest island not considered a continent.",
    "info": "It is larger than any other non-continental landmass.",
    "source": "National Geographic"
  },
  {
    "fact": "The Dead Sea is one of the saltiest large bodies of water.",
    "info": "Its salinity is about 9–10 times that of oceans, making floating easy.",
    "source": "Israel Oceanographic and Limnological Research"
  },
  {
    "fact": "Chess and checkers were both played in ancient forms thousands of years ago.",
    "info": "Checkers traces to ancient Egypt; chess to India around the 6th century.",
    "source": "Encyclopaedia Britannica"
  },
  {
    "fact": "The modern marathon distance is 42.195 km (26.2 miles).",
    "info": "Standardized after the 1908 London Olympics course.",
    "source": "World Athletics"
  },
  {
    "fact": "Walt Disney holds the record for most Academy Awards won by an individual.",
    "info": "He won 22 competitive Oscars.",
    "source": "Academy of Motion Picture Arts and Sciences"
  },
  {
    "fact": "The Burj Khalifa is the tallest building in the world.",
    "info": "Its height is 828 meters (2,717 feet).",
    "source": "Council on Tall Buildings and Urban Habitat"
  },
  {
    "fact": "The Beatles have the most U.S. Billboard Hot 100 number-one hits.",
    "info": "They achieved 20 number-one singles.",
    "source": "Billboard"
  },
  {
    "fact": "The Bible is the most translated book.",
    "info": "Portions have been translated into thousands of languages.",
    "source": "United Bible Societies"
  },
  {
    "fact": "The first SMS text message said 'Merry Christmas.'",
    "info": "Sent in December 1992 by engineer Neil Papworth.",
    "source": "Vodafone"
  },
  {
    "fact": "Email predates the World Wide Web.",
    "info": "Networked email was used in the early 1970s; the Web debuted in 1989–1991.",
    "source": "Internet Society"
  },
  {
    "fact": "The first product scanned with a UPC barcode was a pack of Wrigley’s gum.",
    "info": "Scanned in an Ohio supermarket in 1974.",
    "source": "Smithsonian Institution"
  },
  {
    "fact": "King Harald 'Bluetooth' inspired the Bluetooth name and logo.",
    "info": "The logo merges Nordic runes for H and B.",
    "source": "Bluetooth Special Interest Group"
  },
  {
    "fact": "The first successful powered airplane flight was in 1903.",
    "info": "The Wright brothers flew at Kitty Hawk, North Carolina.",
    "source": "National Air and Space Museum"
  },
  {
    "fact": "A teaspoon of honey represents the lifetime work of roughly 12 bees.",
    "info": "Honey production per bee is tiny; colonies produce collectively.",
    "source": "American Beekeeping Federation"
  },
  {
    "fact": "Bees can be trained to detect scents, including explosives.",
    "info": "Their olfactory sensitivity rivals that of dogs in some tasks.",
    "source": "U.S. Department of Defense"
  },
  {
    "fact": "Pigeons can learn to distinguish words from non-words.",
    "info": "Experiments show orthographic pattern recognition in pigeons.",
    "source": "Proceedings of the National Academy of Sciences"
  },
  {
    "fact": "Goldfish have longer memories than a few seconds.",
    "info": "They can remember tasks and cues for months.",
    "source": "University of Oxford"
  },
  {
    "fact": "Male seahorses get 'pregnant.'",
    "info": "Females deposit eggs into the male’s brood pouch for incubation.",
    "source": "National Geographic"
  },
  {
    "fact": "Penguins use pebbles in courtship and nest-building.",
    "info": "Gentoo and Adélie penguins often present pebbles to mates.",
    "source": "British Antarctic Survey"
  },
  {
    "fact": "Axolotls can regenerate limbs and parts of their heart and spinal cord.",
    "info": "They possess remarkable regenerative capabilities among vertebrates.",
    "source": "Nature Reviews Genetics"
  },
  {
    "fact": "A cockroach can live for days without its head.",
    "info": "It breathes through spiracles; death comes from dehydration or infection.",
    "source": "University of Massachusetts Amherst"
  },
  {
    "fact": "Some frogs can freeze solid and thaw back to life.",
    "info": "Wood frogs survive by producing cryoprotectants like glucose.",
    "source": "University of Alaska Fairbanks"
  },
  {
    "fact": "An octopus can squeeze through any gap larger than its beak.",
    "info": "The beak is the only rigid part of its body.",
    "source": "Monterey Bay Aquarium"
  },
  {
    "fact": "New Zealand has a hill with one of the longest place names.",
    "info": "Taumatawhakatangihangakoauauotamateapokaiwhenuakitanatahu (often shortened).",
    "source": "New Zealand Geographic Board"
  },
  {
    "fact": "Mount Everest grows a few millimeters each year.",
    "info": "Tectonic uplift slowly increases its height.",
    "source": "National Geographic"
  },
  {
    "fact": "Glass in windows does not 'flow' over centuries.",
    "info": "Old panes are uneven due to historical manufacturing, not flow.",
    "source": "American Physical Society"
  },
  {
    "fact": "Humans share about 60% of their genes with bananas.",
    "info": "Many fundamental cellular genes are conserved across life.",
    "source": "National Human Genome Research Institute"
  },
  {
    "fact": "Humans and chimpanzees share about 98–99% of their DNA sequences.",
    "info": "Comparative genomics shows high sequence similarity.",
    "source": "Nature"
  },
  {
    "fact": "Your gut contains more microbial cells than human cells by count.",
    "info": "Microbiome cell counts are roughly comparable or higher than human cells.",
    "source": "Cell"
  },
  {
    "fact": "Yawning can be contagious due to social and empathetic cues.",
    "info": "Studies link susceptibility to empathy and social bonding.",
    "source": "Royal Society Open Science"
  },
  {
    "fact": "The placebo effect can produce measurable physiological changes.",
    "info": "Expectation can modulate pain pathways and neurotransmitters.",
    "source": "Harvard Medical School"
  },
  {
    "fact": "The 'spotlight effect' makes us overestimate how much others notice us.",
    "info": "People typically pay less attention to our mistakes than we think.",
    "source": "Journal of Personality and Social Psychology"
  },
  {
    "fact": "Memory is reconstructive and prone to distortion.",
    "info": "Recalled memories can change with each retrieval (reconsolidation).",
    "source": "Annual Review of Psychology"
  },
  {
    "fact": "We are generally poor at multitasking.",
    "info": "Task-switching causes performance costs and errors.",
    "source": "American Psychological Association"
  },
  {
    "fact": "The Dunning–Kruger effect describes how low performers overestimate their abilities.",
    "info": "Metacognitive deficits can inflate self-assessments.",
    "source": "Journal of Personality and Social Psychology"
  },
  {
    "fact": "Phobias can be effectively treated with exposure therapy.",
    "info": "Gradual exposure reduces fear responses through extinction learning.",
    "source": "National Institute of Mental Health"
  },
  {
    "fact": "Humans are biased to see faces in random patterns (pareidolia).",
    "info": "Face-detection circuits fire even on ambiguous stimuli.",
    "source": "Cortex"
  },
  {
    "fact": "Laughter has health benefits including stress reduction.",
    "info": "It can lower stress hormones and improve pain tolerance.",
    "source": "Mayo Clinic"
  },
  {
    "fact": "The 'Stroop effect' shows automaticity in reading.",
    "info": "Naming ink colors is slower when word meanings conflict.",
    "source": "Journal of Experimental Psychology"
  },
  {
    "fact": "Hippocampus damage can impair new memory formation.",
    "info": "Patient H.M. famously lost the ability to form new episodic memories.",
    "source": "Nature Reviews Neuroscience"
  },
  {
    "fact": "Ant colonies can act like a 'superorganism.'",
    "info": "Collective behavior emerges from simple individual rules.",
    "source": "Annual Review of Entomology"
  },
  {
    "fact": "Spiders are not insects; they are arachnids.",
    "info": "They have eight legs and two main body segments.",
    "source": "Encyclopaedia Britannica"
  },
  {
    "fact": "Jellyfish don’t have brains.",
    "info": "They use a decentralized nerve net to coordinate movement.",
    "source": "Smithsonian Ocean"
  },
  {
    "fact": "Starfish can regenerate lost arms.",
    "info": "Some species can regrow entire bodies from a single arm.",
    "source": "Monterey Bay Aquarium"
  },
  {
    "fact": "A hummingbird’s heart can beat over 1,000 times per minute.",
    "info": "Rates vary by activity and species; very high during flight.",
    "source": "National Audubon Society"
  },
  {
    "fact": "Chameleons change color primarily for communication and temperature regulation.",
    "info": "Not just camouflage; nanocrystal skin structures shift hues.",
    "source": "Nature Communications"
  },
  {
    "fact": "Hot water can freeze faster than cold under certain conditions (Mpemba effect).",
    "info": "Phenomenon observed experimentally; mechanisms vary by setup.",
    "source": "Royal Society of Chemistry"
  },
  {
    "fact": "Liquid water has been detected on planets and moons beyond Earth.",
    "info": "Evidence includes subsurface oceans on Europa and Enceladus.",
    "source": "NASA"
  },
  {
    "fact": "A day on Mercury includes two sunrises for each year.",
    "info": "Its 3:2 spin–orbit resonance causes unusual solar motion.",
    "source": "ESA"
  },
  {
    "fact": "The largest living organism by area is a fungus.",
    "info": "Armillaria in Oregon spans over 3 square miles underground.",
    "source": "U.S. Forest Service"
  },
  {
    "fact": "The Great Barrier Reef is the largest coral reef system.",
    "info": "It stretches over 2,300 km along Australia’s coast.",
    "source": "Great Barrier Reef Marine Park Authority"
  },
  {
    "fact": "A water bear (tardigrade) can survive extreme conditions.",
    "info": "Cryptobiosis lets them endure desiccation, radiation, and vacuum.",
    "source": "Oxford University Press"
  },
  {
    "fact": "The Sahara Desert was once green and wet.",
    "info": "During the African Humid Period, lakes and grasslands covered it.",
    "source": "Science (AAAS)"
  },
  {
    "fact": "The oldest known written recipe is for beer.",
    "info": "Sumerian tablets describe brewing processes over 4,000 years ago.",
    "source": "University of Pennsylvania Museum"
  },
  {
    "fact": "Paper was invented in ancient China.",
    "info": "Traditionally credited to Cai Lun in 105 CE.",
    "source": "Encyclopaedia Britannica"
  },
  {
    "fact": "Gunpowder originated in China.",
    "info": "It spread along trade routes to the Middle East and Europe.",
    "source": "Royal Society of Chemistry"
  },
  {
    "fact": "Zero as a number was developed in India.",
    "info": "Indian mathematicians formalized zero and place-value notation.",
    "source": "MacTutor History of Mathematics"
  },
  {
    "fact": "The Rosetta Stone unlocked Egyptian hieroglyphs.",
    "info": "Its trilingual text enabled decipherment by Champollion.",
    "source": "British Museum"
  },
  {
    "fact": "Machu Picchu was unknown to the outside world until 1911.",
    "info": "Hiram Bingham publicized the Inca site internationally.",
    "source": "Yale University / National Geographic"
  },
  {
    "fact": "The Library of Alexandria was not destroyed in a single event.",
    "info": "Its loss was gradual across multiple incidents and eras.",
    "source": "Oxford Classical Dictionary"
  },
  {
    "fact": "The Black Death drastically reshaped European societies.",
    "info": "Mid-14th-century plague killed a large fraction of the population.",
    "source": "Centers for Disease Control and Prevention"
  },
  {
    "fact": "The printing press revolutionized information spread in Europe.",
    "info": "Gutenberg’s movable type enabled mass production of texts.",
    "source": "Encyclopaedia Britannica"
  },
  {
    "fact": "Michelangelo’s David was carved from a single flawed marble block.",
    "info": "Earlier sculptors abandoned it; Michelangelo completed it in 1504.",
    "source": "Galleria dell’Accademia, Florence"
  },
  {
    "fact": "Coffee originally spread from Ethiopia and Yemen to the world.",
    "info": "The coffeehouse culture blossomed in the Ottoman Empire and Europe.",
    "source": "National Coffee Association"
  },
  {
    "fact": "Chocolate was consumed as a bitter drink in Mesoamerica.",
    "info": "Sweetened solid chocolate developed later in Europe.",
    "source": "Smithsonian Magazine"
  },
  {
    "fact": "Newspaper 'lead' stories are named after typesetting lead, not the metal’s pronunciation.",
    "info": "In journalism the spelling 'lede' distinguished it from the metal.",
    "source": "American Journalism Review"
  },
  {
    "fact": "A 'moment' historically meant 1/40 of an hour.",
    "info": "In medieval timekeeping, a moment was 90 seconds.",
    "source": "Oxford English Dictionary"
  },
  {
    "fact": "Tennis scoring likely derives from the number 60 (sexagesimal system).",
    "info": "Fifteen, thirty, forty (short for forty-five) reflect quarter-hours with later simplification.",
    "source": "International Tennis Federation"
  },
  {
    "fact": "The Olympic motto is 'Citius, Altius, Fortius'—'Faster, Higher, Stronger.'",
    "info": "Updated in 2021 to include 'Communiter'—'Together.'",
    "source": "International Olympic Committee"
  },
  {
    "fact": "Snow isn’t always white; it can appear pink or red ('watermelon snow').",
    "info": "Caused by algae like Chlamydomonas nivalis.",
    "source": "U.S. National Park Service"
  },
  {
    "fact": "A rainbow is a circle; we usually see only an arc.",
    "info": "The horizon blocks the lower part; from aircraft full circles are visible.",
    "source": "Royal Meteorological Society"
  },
  {
    "fact": "You can sometimes see a 'moonbow'—a nighttime rainbow.",
    "info": "It’s produced by moonlight refracting in raindrops.",
    "source": "National Weather Service"
  },
  {
    "fact": "Banana plants are giant herbs, not trees.",
    "info": "Their 'trunk' is a pseudostem made of leaf bases.",
    "source": "Kew Gardens"
  },
  {
    "fact": "Avocados are berries with a single large seed.",
    "info": "They meet the botanical definition of a berry.",
    "source": "University of California Agriculture and Natural Resources"
  },
  {
    "fact": "Onions make you cry by releasing syn-propanethial-S-oxide.",
    "info": "It stimulates the eyes’ lachrymal glands.",
    "source": "American Chemical Society"
  },
  {
    "fact": "Chili peppers feel hot because of capsaicin activating TRPV1 receptors.",
    "info": "It signals heat and pain despite no temperature change.",
    "source": "Nature Reviews Neuroscience"
  },
  {
    "fact": "Sourdough starter is a living culture of wild yeast and bacteria.",
    "info": "Lactic acid bacteria contribute tangy flavor and leavening.",
    "source": "King Arthur Baking / Food Microbiology"
  },
  {
    "fact": "Popcorn pops when internal moisture turns to steam and ruptures the hull.",
    "info": "Optimal popping occurs near 180–190 °C.",
    "source": "American Chemical Society"
  },
  {
    "fact": "Saturn’s rings are made mostly of ice.",
    "info": "Particles range from micrometers to meters, largely water ice.",
    "source": "NASA"
  },
  {
    "fact": "Mars hosts the tallest volcano in the solar system.",
    "info": "Olympus Mons stands ~22 km tall—almost three times Everest.",
    "source": "NASA"
  },
  {
    "fact": "Venus’s clouds produce acid rain.",
    "info": "Its atmosphere contains sulfuric acid droplets, though they evaporate before hitting ground.",
    "source": "European Space Agency"
  },
  {
    "fact": "A day on Mercury is 59 Earth days long.",
    "info": "That’s how long it takes to rotate relative to the Sun.",
    "source": "NASA"
  },
  {
    "fact": "Neptune’s winds are the fastest in the solar system.",
    "info": "Speeds can exceed 2,000 km/h (1,200 mph).",
    "source": "NASA"
  },
  {
    "fact": "Some exoplanets rain glass sideways in supersonic winds.",
    "info": "HD 189733b experiences such extreme weather.",
    "source": "Nature"
  },
  {
    "fact": "The universe’s expansion is accelerating.",
    "info": "Driven by dark energy, discovered via distant supernova observations.",
    "source": "Nobel Prize Committee"
  },
  {
    "fact": "A spoonful of neutron star material weighs about a billion tons.",
    "info": "Neutron star density is extraordinarily high.",
    "source": "NASA"
  },
  {
    "fact": "Climate change is causing faster mountain glacier melt.",
    "info": "Warming trends drive glacier retreat worldwide.",
    "source": "Intergovernmental Panel on Climate Change (IPCC)"
  },
  {
    "fact": "The Arctic is warming twice as fast as the global average.",
    "info": "This phenomenon is called Arctic amplification.",
    "source": "NASA"
  },
  {
    "fact": "Ocean acidification results from increased CO₂ absorption.",
    "info": "Lowered pH can harm shell-forming marine life.",
    "source": "NOAA"
  },
  {
    "fact": "Urban areas can be several degrees warmer than rural surroundings.",
    "info": "This is called the urban heat island effect.",
    "source": "U.S. Environmental Protection Agency"
  },
  {
    "fact": "The ozone hole over Antarctica forms each Southern Hemisphere spring.",
    "info": "Chlorofluorocarbons (CFCs) catalyze ozone breakdown in cold stratospheric conditions.",
    "source": "World Meteorological Organization"
  },
  {
    "fact": "Trees can communicate through underground fungal networks.",
    "info": "Known as the ‘wood wide web,’ they share nutrients and signals.",
    "source": "University of British Columbia"
  },
  {
    "fact": "Planting trees helps cool cities through shade and evapotranspiration.",
    "info": "Urban forestry reduces cooling energy demands.",
    "source": "U.S. Forest Service"
  },
  {
    "fact": "Vaccination has eradicated smallpox worldwide.",
    "info": "Declared eradicated in 1980 thanks to global vaccination campaigns.",
    "source": "World Health Organization"
  },
  {
    "fact": "Penicillin was discovered from a mold accidentally.",
    "info": "Alexander Fleming noticed bacterial inhibition around Penicillium in 1928.",
    "source": "Nobel Prize Committee"
  },
  {
    "fact": "The first successful human organ transplant was a kidney in 1954.",
    "info": "Performed between identical twins to avoid rejection.",
    "source": "American Journal of Surgery"
  },
  {
    "fact": "MRI uses magnetic fields and radio waves, not X-rays.",
    "info": "It provides detailed images without ionizing radiation.",
    "source": "Radiological Society of North America"
  },
  {
    "fact": "CRISPR allows targeted gene editing.",
    "info": "It enables precise modification of DNA sequences.",
    "source": "Science (Jennifer Doudna & Emmanuelle Charpentier, Nobel Prize)"
  },
  {
    "fact": "The first heart implant was a pacemaker in 1958.",
    "info": "It regulated heartbeat when natural pacing failed.",
    "source": "American Heart Association"
  },
  {
    "fact": "X-rays were discovered in 1895 accidentally.",
    "info": "Wilhelm Röntgen observed them while experimenting with cathode rays.",
    "source": "Nobel Prize Committee"
  },
  {
    "fact": "The polio vaccine nearly eradicated the disease worldwide.",
    "info": "Developed by Jonas Salk (injectable) and Albert Sabin (oral).",
    "source": "WHO"
  },
  {
    "fact": "Pasteurization uses heat to kill harmful microbes in food.",
    "info": "Developed by Louis Pasteur in the 19th century.",
    "source": "Louvain Pasteur Institute"
  },
  {
    "fact": "The first artificial satellite was Sputnik-1 (1957).",
    "info": "Launched by the Soviet Union, beginning the space age.",
    "source": "NASA"
  },
  {
    "fact": "The first human in space was Yuri Gagarin (1961).",
    "info": "He orbited Earth aboard Vostok-1.",
    "source": "Roscosmos"
  },
  {
    "fact": "The International Space Station has been continuously inhabited since 2000.",
    "info": "A multinational orbiting laboratory supporting science.",
    "source": "NASA"
  },
  {
    "fact": "Wright brothers flew in 1903 with a gasoline engine-powered plane.",
    "info": "The first controlled, powered flight was in December 1903.",
    "source": "National Air and Space Museum"
  },
  {
    "fact": "The first electronic computer was ENIAC (1945).",
    "info": "It performed arithmetic calculations using vacuum tubes.",
    "source": "Computer History Museum"
  },
  {
    "fact": "The World Wide Web was invented in 1989 by Tim Berners-Lee.",
    "info": "At CERN for sharing research information.",
    "source": "CERN"
  },
  {
    "fact": "A global positioning system (GPS) needs at least four satellites for a fix.",
    "info": "Three for position, one for timing correction.",
    "source": "U.S. Department of Defense"
  },
  {
    "fact": "The first car with an assembly line was Ford’s Model T (1913).",
    "info": "Assembly-line production drastically cut costs.",
    "source": "Ford Motor Company"
  },
  {
    "fact": "The first programmable logic controller (PLC) was created in 1968.",
    "info": "Designed to replace relay logic in industrial control.",
    "source": "IEEE"
  },
  {
    "fact": "The Hoover Dam is among the largest concrete structures.",
    "info": "Constructed in the 1930s across the Colorado River.",
    "source": "U.S. Bureau of Reclamation"
  },
  {
    "fact": "The Eiffel Tower was built as an engineering marvel for the 1889 Exposition.",
    "info": "Designed by Gustave Eiffel.",
    "source": "Tour Eiffel"
  },
  {
    "fact": "The Panama Canal uses a lock system instead of a sea-level passage.",
    "info": "Ships are lifted and lowered between ocean and lake levels.",
    "source": "Panama Canal Authority"
  },
  {
    "fact": "The first liquid-fueled rocket was launched by Robert Goddard in 1926.",
    "info": "Paved the way for modern rocketry.",
    "source": "Smithsonian Air and Space Museum"
  },
  {
    "fact": "The first artificial neural network was the perceptron (1958).",
    "info": "Developed by Frank Rosenblatt.",
    "source": "Cornell University archives"
  },
  {
    "fact": "LEDs were first practical in the 1960s.",
    "info": "The first visible-spectrum (red) LEDs appeared in 1962.",
    "source": "IEEE"
  },
  {
    "fact": "The first smartphone prototype (IBM Simon) debuted in 1994.",
    "info": "Combined PDA and mobile phone features.",
    "source": "IBM"
  },
  {
    "fact": "The first voicemail system was invented in 1979.",
    "info": "Created by Gordon Matthews.",
    "source": "U.S. Patent Office"
  },
  {
    "fact": "The first email spam was sent in 1978.",
    "info": "Promoting a product to ARPANET users.",
    "source": "Computer History Museum"
  },
  {
    "fact": "The first image uploaded to the web was a photo of Les Horribles Cernettes.",
    "info": "Uploaded by Tim Berners-Lee in 1992.",
    "source": "CERN"
  },
  {
    "fact": "Concrete gets stronger over time due to ongoing chemical reactions.",
    "info": "Hydration of cement continues for decades.",
    "source": "Portland Cement Association"
  },
  {
    "fact": "The Tacoma Narrows Bridge collapsed due to aeroelastic flutter (1930).",
    "info": "Design couldn’t damp out wind-induced oscillations.",
    "source": "American Society of Civil Engineers"
  },
  {
    "fact": "Fiber optics transmit data via light through glass fibers.",
    "info": "They use total internal reflection for very fast communication.",
    "source": "Corning Incorporated"
  },
  {
    "fact": "The first barcode was invented in 1949.",
    "info": "Used to automate toll booths.",
    "source": "U.S. Patent Office"
  },
  {
    "fact": "The magnetic levitation (maglev) train uses magnets to float above tracks.",
    "info": "Reduces friction for high-speed transport.",
    "source": "Central Japan Railway Company"
  },
  {
    "fact": "The first lunar module landed on the moon in 1969 (Apollo 11).",
    "info": "Named Eagle; Neil Armstrong first stepped out.",
    "source": "NASA"
  },
  {
    "fact": "Modern jet engines operate on Brayton cycle thermodynamics.",
    "info": "They compress, ignite, and expand air for thrust.",
    "source": "Rolls-Royce"
  },
  {
    "fact": "The bullet train (Shinkansen) began operations in Japan in 1964.",
    "info": "Connected Tokyo and Osaka.",
    "source": "Japan Railways Group"
  },
  {
    "fact": "Renewable energy share in global electricity is steadily rising.",
    "info": "Driven by solar, wind, and hydro growth.",
    "source": "International Energy Agency"
  },
  {
    "fact": "3D printing builds objects layer by layer from digital models.",
    "info": "Used in prototyping, medical implants, and manufacturing.",
    "source": "MIT Technology Review"
  },
  {
    "fact": "The first operating system with a graphical user interface was the Xerox Alto (1973).",
    "info": "Inspired future GUIs like those at Apple and Microsoft.",
    "source": "Xerox PARC"
  },
  {
    "fact": "The transistor was invented in 1947 at Bell Labs.",
    "info": "It revolutionized electronics by replacing vacuum tubes.",
    "source": "Nobel Prize Committee"
  },
  {
    "fact": "Bluetooth was originally intended as a wireless headset standard.",
    "info": "It evolved into a multipurpose short-range wireless protocol.",
    "source": "Bluetooth SIG"
  },
  {
    "fact": "The first commercial computer hard drive (IBM 305 RAMAC) was released in 1956.",
    "info": "Had a 5 MB capacity and weighed over a ton.",
    "source": "Computer History Museum"
  },
  {
    "fact": "Touchscreens date back to the 1960s (E.A. Johnson).",
    "info": "Resistive and capacitive technologies evolved from early research.",
    "source": "Nature"
  },
  {
    "fact": "Hovercraft travel on a cushion of air beneath them.",
    "info": "Also known as air-cushion vehicles.",
    "source": "British Hovercraft Corporation"
  },
  {
    "fact": "Invented in 1914, plastic was originally called 'Bakelite.'",
    "info": "The first fully synthetic polymer.",
    "source": "Smithsonian Institution"
  },
  {
    "fact": "The Hyperloop concept proposes near-supersonic travel in vacuum tubes.",
    "info": "First proposed by Elon Musk in 2013.",
    "source": "SpaceX"
  },
  {
    "fact": "The first powered flight by a jet engine was by Heinkel He 178 (1939).",
    "info": "German aircraft, early gas turbine-powered flight.",
    "source": "Deutsche Luftfahrt-Bibliothek"
  },
  {
    "fact": "Ultrasound imaging uses high-frequency sound to visualize organs.",
    "info": "Widely used for fetal imaging and diagnostics.",
    "source": "Radiological Society of North America"
  },
  {
    "fact": "The stethoscope was invented in 1816 by René Laennec.",
    "info": "Originally a wooden tube before evolving into modern versions.",
    "source": "British Medical Journal"
  },
  {
    "fact": "Insulin therapy for diabetes began in 1922.",
    "info": "Developed by Banting and Best.",
    "source": "Canadian Medical Association Journal"
  },
  {
    "fact": "Anesthesia revolutionized surgery in the mid-19th century.",
    "info": "Ether and chloroform allowed painless operations.",
    "source": "Journal of the American Medical Association"
  },
  {
    "fact": "The first antibiotic used widely was penicillin in the 1940s.",
    "info": "It dramatically reduced deaths from bacterial infections.",
    "source": "Centers for Disease Control and Prevention"
  },
  {
    "fact": "Suture materials date back thousands of years, including silk and catgut.",
    "info": "Ancient surgeons used natural fibers long before synthetic options.",
    "source": "World Health Organization"
  },
  {
    "fact": "Robotic surgery (e.g. da Vinci system) enables minimally invasive procedures.",
    "info": "Surgeons control robotic arms for precision.",
    "source": "FDA"
  },
  {
    "fact": "X-rays can also treat certain cancers as radiotherapy.",
    "info": "High-energy electromagnetic radiation targets tumors.",
    "source": "American Cancer Society"
  }
]
